# command-line utilities
brew "git"
brew "vim"
brew "curl"
brew "node"
brew "ffmpeg"
brew "cask"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "pnpm"
brew "npm"
brew "gh"

# containers
brew "colima"
brew "docker"
brew "helm"
brew "helmfile"
brew "krew"
brew "kubectx"

# apps
cask "cursor"
cask "google-chrome"
cask "linearmouse"
cask "hiddenbar"
cask "obs"
cask "bigwig-club/brew/upic"

# fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
