# command-line utilities
brew "git"
brew "vim"
brew "curl"
brew "jq"
brew "yq"
brew "cask"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "gh"
brew "speedtest-cli"
brew "asciinema"
brew "telnet"

# containers
brew "colima"
brew "docker"
brew "helm"
brew "helmfile"
brew "krew"
brew "kubectx"

# Development Apps
cask "iterm2"
cask "cursor"
cask "visual-studio-code"
cask "antigravity"

# Development Langs, Compilers, Package Managers and SDKs
brew "gcc"
brew "go"
brew "lua"
brew "luarocks"
brew "node"
brew "nvm"
brew "npm"
brew "pnpm"
brew "openjdk"
brew "python"
brew "rust"

# apps
cask "google-chrome"
cask "firefox"
cask "linearmouse"
cask "hiddenbar"
cask "istat-menus"
cask "obs"
cask "mark-text"
cask "bigwig-club/brew/upic"
brew "ffmpeg"
cask "obsidian"
cask "netnewswire"
cask "rapidapi"
cask "telegram"
cask "snipaste"
cask "appcleaner"
cask "eudic"
cask "discord"

# fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-hack"
cask "font-inconsolata"
cask "font-meslo-lg-nerd-font"
